## production: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 6 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210706203355351400000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_appstore_metrics:8" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_appstore_metrics:8" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:b83a460d229464f29afc24babe75eabe8c8813a9" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:eb4facab8d72aae788eb730a58110417df115547"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_appstore_metrics" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.masked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_inapp_metrics_event_rule-terraform-20210709161928461300000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_inapp_metrics:4" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_inapp_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_inapp_metrics:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:b83a460d229464f29afc24babe75eabe8c8813a9" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:eb4facab8d72aae788eb730a58110417df115547"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_inapp_metrics" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210706203355353300000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_server_metrics:10" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_server_metrics:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:b83a460d229464f29afc24babe75eabe8c8813a9" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:eb4facab8d72aae788eb730a58110417df115547"
                    # (10 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_appstore_metrics_event_rule-terraform-20210706203355530800000005"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_appstore_metrics:8" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_appstore_metrics:8" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:b83a460d229464f29afc24babe75eabe8c8813a9" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:eb4facab8d72aae788eb730a58110417df115547"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_appstore_metrics" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_inapp_metrics_event_rule-terraform-20210709161928511000000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_inapp_metrics:4" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_inapp_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_inapp_metrics:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:b83a460d229464f29afc24babe75eabe8c8813a9" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:eb4facab8d72aae788eb730a58110417df115547"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_inapp_metrics" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_server_metrics_event_rule-terraform-20210706203355649900000006"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_server_metrics:10" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_server_metrics:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:b83a460d229464f29afc24babe75eabe8c8813a9" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:eb4facab8d72aae788eb730a58110417df115547"
                    # (10 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_server_metrics" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 6 to add, 6 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>